# ViewSolarstudyMultidayDatetimeText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyMultidayDatetimeText Property
ParameterTypeId Class See Also
---
"Multi-day date and time text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyMultidayDatetimeText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyMultidayDatetimeText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyMultidayDatetimeText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace